noccy80/mspdev/reference/MSP430ware/deprecated/IAR/msp430fg4617.h
#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  DEFXW                               DMA0SAL;
  DEFXA                               DMA0SA;
} @ 0x01D2;
#endif
#define DMA0DA_             (0x01d6)    /* DMA Channel 0 Destination Address */
#ifndef __IAR_SYSTEMS_ICC__
DEFA(   DMA0DA            , DMA0DA_)
#endif
#define DMA0DAL_            (0x01d6)    /* DMA Channel 0 Destination Address */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   DMA0DAL           , DMA0DAL_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  DEFXW                               DMA0DAL;
  DEFXA                               DMA0DA;
} @ 0x01D6;
#endif
#define DMA0SZ_             (0x01dau)    /* DMA Channel 0 Transfer Size */
DEFW(   DMA0SZ            , DMA0SZ_)
#define DMA1SA_             (0x01de)    /* DMA Channel 1 Source Address */
#ifndef __IAR_SYSTEMS_ICC__
DEFA(   DMA1SA            , DMA1SA_)
#endif
#define DMA1SAL_            (0x01de)    /* DMA Channel 1 Source Address */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   DMA1SAL           , DMA1SAL_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  DEFXW                               DMA1SAL;
  DEFXA                               DMA1SA;
} @ 0x01DE;
#endif
#define DMA1DA_             (0x01e2)    /* DMA Channel 1 Destination Address */
#ifndef __IAR_SYSTEMS_ICC__
DEFA(   DMA1DA            , DMA1DA_)
#endif
#define DMA1DAL_            (0x01e2)    /* DMA Channel 1 Destination Address */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   DMA1DAL           , DMA1DAL_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  DEFXW                               DMA1DAL;
  DEFXA                               DMA1DA;
} @ 0x01E2;
#endif
#define DMA1SZ_             (0x01e6u)    /* DMA Channel 1 Transfer Size */
DEFW(   DMA1SZ            , DMA1SZ_)
#define DMA2SA_             (0x01ea)    /* DMA Channel 2 Source Address */
#ifndef __IAR_SYSTEMS_ICC__
DEFA(   DMA2SA            , DMA2SA_)
#endif
#define DMA2SAL_            (0x01ea)    /* DMA Channel 2 Source Address */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   DMA2SAL           , DMA2SAL_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  DEFXW                               DMA2SAL;
  DEFXA                               DMA2SA;
} @ 0x01EA;
#endif
#define DMA2DA_             (0x01ee)    /* DMA Channel 2 Destination Address */
#ifndef __IAR_SYSTEMS_ICC__
DEFA(   DMA2DA            , DMA2DA_)
#endif
#define DMA2DAL_            (0x01ee)    /* DMA Channel 2 Destination Address */
#ifndef __IAR_SYSTEMS_ICC__
DEFW(   DMA2DAL           , DMA2DAL_)
#endif

#ifdef __IAR_SYSTEMS_ICC__
__no_init union
{
  DEFXW                               DMA2DAL;
  DEFXA                               DMA2DA;
} @ 0x01EE;
#endif
#define DMA2SZ_             (0x01f2u)    /* DMA Channel 2 Transfer Size */
DEFW(   DMA2SZ            , DMA2SZ_)

/* DMAIV Definitions */
#define DMAIV_NONE           (0x0000u)    /* No Interrupt pending */
#define DMAIV_DMA0IFG        (0x0002u)    /* DMA0IFG */
#define DMAIV_DMA1IFG        (0x0004u)    /* DMA1IFG */
#define DMAIV_DMA2IFG        (0x0006u)    /* DMA2IFG */

/*************************************************************
* Flash Memory
*************************************************************/
#define __MSP430_HAS_FLASH__          /* Definition to show that Module is available */
#define __MSP430_HAS_2FLASH_IP__      /* Definition to show that Module is available */

#define FCTL1_              (0x0128u)  /* FLASH Control 1 */
DEFW(   FCTL1             , FCTL1_)
#define FCTL2_              (0x012Au)  /* FLASH Control 2 */
DEFW(   FCTL2             , FCTL2_)
#define FCTL3_              (0x012Cu)  /* FLASH Control 3 */
DEFW(   FCTL3             , FCTL3_)

#define FRKEY               (0x9600u)  /* Flash key returned by read */
#define FWKEY               (0xA500u)  /* Flash key for write */
#define FXKEY               (0x3300u)  /* for use with XOR instruction */

#define ERASE               (0x0002u)  /* Enable bit for Flash segment erase */
#define MERAS               (0x0004u)  /* Enable bit for Flash mass erase */
#define GMERAS              (0x0008u)  /* Enable bit for Flash global mass erase */
#define CPUEX               (0x0010u)  /* Enable bit for CPU Execution during Flash write/erase */
#define WRT                 (0x0040u)  /* Enable bit for Flash write */
#define BLKWRT              (0x0080u)  /* Enable bit for Flash segment write */
#define SEGWRT              (0x0080u)  /* old definition */ /* Enable bit for Flash segment write */

#define FN0                 (0x0001u)  /* Divide Flash clock by 1 to 64 using FN0 to FN5 according to: */
#define FN1                 (0x0002u)  /*  32*FN5 + 16*FN4 + 8*FN3 + 4*FN2 + 2*FN1 + FN0 + 1 */
#ifndef FN2
#define FN2                 (0x0004u)
#endif
#ifndef FN3
#define FN3                 (0x0008u)
#endif
#ifndef FN4
#define FN4                 (0x0010u)
#endif
#define FN5                 (0x0020u)
#define FSSEL0              (0x0040u)  /* Flash clock select 0 */        /* to distinguish from USART SSELx */
#define FSSEL1              (0x0080u)  /* Flash clock select 1 */

#define FSSEL_0             (0x0000u)  /* Flash clock select: 0 - ACLK */
#define FSSEL_1             (0x0040u)  /* Flash clock select: 1 - MCLK */
#define FSSEL_2             (0x0080u)  /* Flash clock select: 2 - SMCLK */
#define FSSEL_3             (0x00C0u)  /* Flash clock select: 3 - SMCLK */

#define BUSY                (0x0001u)  /* Flash busy: 1 */
#define KEYV                (0x0002u)  /* Flash Key violation flag */
#define ACCVIFG             (0x0004u)  /* Flash Access violation flag */
#define WAIT                (0x0008u)  /* Wait flag for segment write */
#define LOCK                (0x0010u)  /* Lock bit: 1 - Flash is locked (read only) */
#define EMEX                (0x0020u)  /* Flash Emergency Exit */

/************************************************************
* SYSTEM CLOCK, FLL+
************************************************************/
#define __MSP430_HAS_FLLPLUS__        /* Definition to show that Module is available */

